

# 1. "1 2 3 4 5" найдите самое большое и маленькое число в этой строке и верните их кортежем.   

# def funck_str(st):
#     res = list(map(int, st.split()))
#     res_st = tuple(res)
#     return max(res_st), min(res_st)

# print(funck_str("1 2 3 4 5"))

# 2.Написать программу, которая может принимать любое неотрицательное целое число в качестве аргумента и возвращать новое максимально возможное значение, составленное из цифр этого же числа. По сути, просто переставить цифры, чтобы создать максимально возможное число.   

# def funck_int(figure: int):
#     return int(''.join(sorted(list(str(figure)), reverse=True)))

# print(funck_int(52369))

# 3.Передается список, состоящий из строк и букв, нужно вернуть новый список, содержащий только цифры.   

# def funck_list(ls):
#     return list(filter(lambda x: isinstance(x, int), ls))

# print(funck_list(['re', 95, 4, '54', 'ew', 234, 'ewrg']))

# 4.С клавиатуры вводится натуральное число. Найти его наибольшую цифру. Например, введено число 764580. Наибольшая цифра в нем 8.

# def number():
#     a = int(input('Введите число:'))
#     return max(list(str(a)))

# print(number())
